<!-- add-pr-comment:add-pr-comment -->

## Terraform github repositories plan
```
data.github_team.test_team_access: Reading...
data.github_team.operations_engineering_test: Reading...
module.ministryofjustice-test.module.test-repo-levg.github_repository.default: Refreshing state... [id=test-repo-levg]
module.ministryofjustice-test.module.test_tamf_repo_test_org.github_repository.default: Refreshing state... [id=test-tamf-repo-test-org]
module.ministryofjustice.module.terraform-aws-mtasts.github_repository.default: Refreshing state... [id=terraform-aws-mtasts]
module.ministryofjustice.module.operations-engineering-example.github_repository.default: Refreshing state... [id=operations-engineering-example]
module.ministryofjustice.module.acronyms.github_repository.default: Refreshing state... [id=acronyms]
module.ministryofjustice.module.technical-guidance.github_repository.default: Refreshing state... [id=technical-guidance]
module.ministryofjustice.module.operations-engineering-dns-spike.github_repository.default: Refreshing state... [id=operations-engineering-dns-spike]
module.ministryofjustice.module.operations-engineering-dns-form.github_repository.default: Refreshing state... [id=operations-engineering-dns-form]
module.ministryofjustice.module.operations-engineering-dns-issues.github_repository.default: Refreshing state... [id=operations-engineering-dns-issues]
module.ministryofjustice.module.operations-engineering-octodns-poc.github_repository.default: Refreshing state... [id=operations-engineering-octodns-poc]
module.ministryofjustice.module.operations-engineering-github-actions-dashboard.github_repository.default: Refreshing state... [id=operations-engineering-github-actions-dashboard]
module.ministryofjustice.module.cloud-platform-maintenance-pages.github_repository.default: Refreshing state... [id=cloud-platform-maintenance-pages]
module.ministryofjustice.module.moj-terraform-scim-github.github_repository.default: Refreshing state... [id=moj-terraform-scim-github]
module.ministryofjustice.module.tech-docs-monitor.github_repository.default: Refreshing state... [id=tech-docs-monitor]
data.github_team.operations_engineering_test: Read complete after 1s [id=9456244]
module.ministryofjustice.module.operations-engineering-devcontainer.github_repository.default: Refreshing state... [id=operations-engineering-devcontainer]
module.ministryofjustice.module.operations-engineering-find-a-github-repository-owner.github_repository.default: Refreshing state... [id=operations-engineering-find-a-github-repository-owner]
data.github_team.test_team_access: Read complete after 1s [id=9472191]
module.ministryofjustice.module.template-documentation-site.github_repository.default: Refreshing state... [id=template-documentation-site]
module.ministryofjustice.module.operations-engineering-runbooks.github_repository.default: Refreshing state... [id=operations-engineering-runbooks]
module.ministryofjustice.module.tech-docs-github-pages-publisher.github_repository.default: Refreshing state... [id=tech-docs-github-pages-publisher]
module.ministryofjustice.module.operations-engineering-certificate-renewal.github_repository.default: Refreshing state... [id=operations-engineering-certificate-renewal]
module.ministryofjustice.module.moj-terraform-aws-sso.github_repository.default: Refreshing state... [id=moj-terraform-aws-sso]
module.ministryofjustice.module.operations-engineering.github_repository.default: Refreshing state... [id=operations-engineering]
module.ministryofjustice.module.operations-engineering-cloud-platform-namespace.github_repository.default: Refreshing state... [id=operations-engineering-cloud-platform-namespace]
module.ministryofjustice.module.operations-engineering-support-metadata.github_repository.default: Refreshing state... [id=operations-engineering-support-metadata]
module.ministryofjustice.module.operations-engineering-flask-template.github_repository.default: Refreshing state... [id=operations-engineering-flask-template]
data.github_team.operations_engineering: Reading...
module.ministryofjustice.module.operations-engineering-join-github.github_repository.default: Refreshing state... [id=operations-engineering-join-github]
module.ministryofjustice.module.github-collaborators.github_repository.default: Refreshing state... [id=github-collaborators]
module.ministryofjustice.module.operations-engineering-unit-test-generator-poc.github_repository.default: Refreshing state... [id=operations-engineering-unit-test-generator-poc]
module.ministryofjustice.module.terraform-github-repository.github_repository.default: Refreshing state... [id=terraform-github-repository]
module.ministryofjustice.module.test_tamf_repo_2.github_repository.default: Refreshing state... [id=test-tamf-repo-2]
module.ministryofjustice.module.operations-engineering-user-guide.github_repository.default: Refreshing state... [id=operations-engineering-user-guide]
module.ministryofjustice.module.operations-engineering-reports.github_repository.default: Refreshing state... [id=operations-engineering-reports]
module.ministryofjustice.module.template-repository.github_repository.default: Refreshing state... [id=template-repository]
module.ministryofjustice.module.operations-engineering-kpi-dashboard.github_repository.default: Refreshing state... [id=operations-engineering-kpi-dashboard]
module.ministryofjustice.module.github-actions.github_repository.default: Refreshing state... [id=github-actions]
module.ministryofjustice.module.operations-engineering-documentation-browser-extension.github_repository.default: Refreshing state... [id=operations-engineering-documentation-browser-extension]
module.ministryofjustice.module.operations-engineering-metadata-poc.github_repository.default: Refreshing state... [id=operations-engineering-metadata-poc]
module.ministryofjustice.module.operations-engineering-certificate-form.github_repository.default: Refreshing state... [id=operations-engineering-certificate-form]
module.ministryofjustice.data.aws_secretsmanager_secret.example_secret: Reading...
module.ministryofjustice.module.operations-engineering-example.github_branch_protection.default: Refreshing state... [id=BPR_kwDOKnX9OM4CwPGH]
module.ministryofjustice.module.operations-engineering-example.data.github_actions_public_key.default: Reading...
module.ministryofjustice.data.aws_secretsmanager_secret.example_secret: Read complete after 0s [id=arn:aws:secretsmanager:eu-west-2:880656497252:secret:EXAMPLE_SECRET-8FFCA9]
module.ministryofjustice.module.operations-engineering-example.github_actions_variable.default["PRODUCTION_ECR_REGION"]: Refreshing state... [id=operations-engineering-example:PRODUCTION_ECR_REGION]
module.ministryofjustice.module.operations-engineering-example.github_actions_variable.default["PRODUCTION_ECR_REPOSITORY"]: Refreshing state... [id=operations-engineering-example:PRODUCTION_ECR_REPOSITORY]
module.ministryofjustice.module.operations-engineering-example.github_actions_variable.default["DEVELOPMENT_ECR_REGION"]: Refreshing state... [id=operations-engineering-example:DEVELOPMENT_ECR_REGION]
module.ministryofjustice.module.operations-engineering-example.github_actions_variable.default["DEVELOPMENT_ECR_REPOSITORY"]: Refreshing state... [id=operations-engineering-example:DEVELOPMENT_ECR_REPOSITORY]
module.ministryofjustice.module.technical-guidance.data.github_actions_public_key.default: Reading...
data.github_team.operations_engineering: Read complete after 6s [id=4192115]
module.ministryofjustice.module.technical-guidance.github_branch_protection.default: Refreshing state... [id=BPR_kwDOBeUD0s4CwPiB]
module.ministryofjustice-test.module.test-repo-levg.data.github_actions_public_key.default: Reading...
module.ministryofjustice-test.module.test-repo-levg.data.github_actions_public_key.default: Read complete after 0s [id=3380204578043523366]
module.ministryofjustice-test.module.test-repo-levg.github_branch_protection.default: Refreshing state... [id=BPR_kwDOLPRAVc4CyGYH]
module.ministryofjustice.module.acronyms.github_branch_protection.default: Refreshing state... [id=BPR_kwDODR2mI84CwGtl]
module.ministryofjustice.module.operations-engineering-example.data.github_actions_public_key.default: Read complete after 4s [id=3380204578043523366]
module.ministryofjustice.module.acronyms.data.github_actions_public_key.default: Reading...
module.ministryofjustice-test.module.test_tamf_repo_test_org.github_branch_protection.default: Refreshing state... [id=BPR_kwDOLRPf2c4Cyrgo]
module.ministryofjustice-test.module.test_tamf_repo_test_org.data.github_actions_public_key.default: Reading...
module.ministryofjustice.module.terraform-aws-mtasts.github_branch_protection.default: Refreshing state... [id=BPR_kwDOHWUugs4CwPiH]
module.ministryofjustice.module.terraform-aws-mtasts.data.github_actions_public_key.default: Reading...
module.ministryofjustice.module.operations-engineering-dns-spike.github_branch_protection.default: Refreshing state... [id=BPR_kwDOL4z9984C-v0W]
module.ministryofjustice.module.technical-guidance.data.github_actions_public_key.default: Read complete after 4s [id=3380204578043523366]
module.ministryofjustice.module.operations-engineering-dns-spike.data.github_actions_public_key.default: Reading...
module.ministryofjustice.module.operations-engineering-github-actions-dashboard.data.github_actions_public_key.default: Reading...
module.ministryofjustice.module.operations-engineering-github-actions-dashboard.github_branch_protection.default: Refreshing state... [id=BPR_kwDOMRCOOM4DF_rj]
module.ministryofjustice.module.cloud-platform-maintenance-pages.data.github_actions_public_key.default: Reading...
module.ministryofjustice.module.cloud-platform-maintenance-pages.github_branch_protection.default: Refreshing state... [id=BPR_kwDOEeVbDs4CwGth]
module.ministryofjustice-test.module.test_tamf_repo_test_org.data.github_actions_public_key.default: Read complete after 2s [id=3380204578043523366]
module.ministryofjustice.module.moj-terraform-scim-github.data.github_actions_public_key.default: Reading...
module.ministryofjustice.module.acronyms.data.github_actions_public_key.default: Read complete after 3s [id=3380204578043523366]
module.ministryofjustice.module.moj-terraform-scim-github.github_branch_protection.default: Refreshing state... [id=BPR_kwDOEoPJ8s4CwGtf]
module.ministryofjustice.module.operations-engineering-devcontainer.data.github_actions_public_key.default: Reading...
module.ministryofjustice.module.terraform-aws-mtasts.data.github_actions_public_key.default: Read complete after 4s [id=3380204578043523366]
module.ministryofjustice.module.operations-engineering-devcontainer.github_branch_protection.default: Refreshing state... [id=BPR_kwDOLCkQts4Cv-3X]
module.ministryofjustice.module.template-documentation-site.data.github_actions_public_key.default: Reading...
module.ministryofjustice.module.operations-engineering-dns-spike.data.github_actions_public_key.default: Read complete after 5s [id=3380204578043523366]
module.ministryofjustice.module.template-documentation-site.github_branch_protection.default: Refreshing state... [id=BPR_kwDOEQGgTs4CwPiI]
module.ministryofjustice.module.operations-engineering-github-actions-dashboard.data.github_actions_public_key.default: Read complete after 5s [id=3380204578043523366]
module.ministryofjustice.module.operations-engineering-dns-form.data.github_actions_public_key.default: Reading...
module.ministryofjustice.module.operations-engineering-dns-form.github_branch_protection.default: Refreshing state... [id=BPR_kwDOMDCRNs4DB666]
module.ministryofjustice.module.cloud-platform-maintenance-pages.data.github_actions_public_key.default: Read complete after 5s [id=3380204578043523366]
module.ministryofjustice.module.operations-engineering-dns-issues.data.github_actions_public_key.default: Reading...
module.ministryofjustice.module.operations-engineering-dns-issues.github_branch_protection.default: Refreshing state... [id=BPR_kwDOMIbLL84DDdaX]
module.ministryofjustice.module.moj-terraform-scim-github.data.github_actions_public_key.default: Read complete after 6s [id=3380204578043523366]
module.ministryofjustice.module.operations-engineering-octodns-poc.github_branch_protection.default: Refreshing state... [id=BPR_kwDOMK6SNs4DEK2K]
module.ministryofjustice.module.operations-engineering-octodns-poc.data.github_actions_public_key.default: Reading...
module.ministryofjustice.module.operations-engineering-devcontainer.data.github_actions_public_key.default: Read complete after 6s [id=3380204578043523366]
module.ministryofjustice.module.operations-engineering-runbooks.data.github_actions_public_key.default: Reading...
module.ministryofjustice.module.operations-engineering-runbooks.github_branch_protection.default: Refreshing state... [id=BPR_kwDOKK8OCc4CwPGM]
module.ministryofjustice.module.template-documentation-site.data.github_actions_public_key.default: Read complete after 6s [id=3380204578043523366]
module.ministryofjustice.module.tech-docs-github-pages-publisher.data.github_actions_public_key.default: Reading...
module.ministryofjustice.module.tech-docs-github-pages-publisher.github_branch_protection.default: Refreshing state... [id=BPR_kwDOE7RAx84CwPh_]
module.ministryofjustice.module.operations-engineering-dns-form.data.github_actions_public_key.default: Read complete after 6s [id=3380204578043523366]
module.ministryofjustice.module.operations-engineering-certificate-renewal.data.github_actions_public_key.default: Reading...
module.ministryofjustice.module.operations-engineering-certificate-renewal.github_branch_protection.default: Refreshing state... [id=BPR_kwDOI-Hjhc4CwPF_]
module.ministryofjustice.module.operations-engineering-dns-issues.data.github_actions_public_key.default: Read complete after 6s [id=3380204578043523366]
module.ministryofjustice.module.tech-docs-monitor.github_branch_protection.default: Refreshing state... [id=BPR_kwDOHQFa_s4CwPiA]
module.ministryofjustice.module.tech-docs-monitor.data.github_actions_public_key.default: Reading...
module.ministryofjustice.module.moj-terraform-aws-sso.data.github_actions_public_key.default: Reading...
module.ministryofjustice.module.operations-engineering-octodns-poc.data.github_actions_public_key.default: Read complete after 8s [id=3380204578043523366]
module.ministryofjustice.module.moj-terraform-aws-sso.github_branch_protection.default: Refreshing state... [id=BPR_kwDOEYOl7c4CwGtj]
module.ministryofjustice.module.operations-engineering-runbooks.data.github_actions_public_key.default: Read complete after 7s [id=3380204578043523366]
module.ministryofjustice.module.operations-engineering-find-a-github-repository-owner.github_branch_protection.default: Refreshing state... [id=BPR_kwDOManiY84DIuFG]
module.ministryofjustice.module.operations-engineering-find-a-github-repository-owner.data.github_actions_public_key.default: Reading...
module.ministryofjustice.module.tech-docs-github-pages-publisher.data.github_actions_public_key.default: Read complete after 6s [id=3380204578043523366]
module.ministryofjustice.module.operations-engineering-cloud-platform-namespace.data.github_actions_public_key.default: Reading...
module.ministryofjustice.module.operations-engineering-cloud-platform-namespace.github_branch_protection.default: Refreshing state... [id=BPR_kwDOMwMIn84DPMnV]
module.ministryofjustice.module.operations-engineering-certificate-renewal.data.github_actions_public_key.default: Read complete after 6s [id=3380204578043523366]
module.ministryofjustice.module.operations-engineering-support-metadata.data.github_actions_public_key.default: Reading...
module.ministryofjustice.module.operations-engineering-support-metadata.github_branch_protection.default: Refreshing state... [id=BPR_kwDOLWBtds4Cz8XQ]
module.ministryofjustice.module.operations-engineering-join-github.github_actions_variable.default["PROD_ECR_REGISTRY"]: Refreshing state... [id=operations-engineering-join-github:PROD_ECR_REGISTRY]
module.ministryofjustice.module.tech-docs-monitor.data.github_actions_public_key.default: Read complete after 8s [id=3380204578043523366]
module.ministryofjustice.module.operations-engineering-join-github.github_actions_variable.default["DEV_ECR_REGION"]: Refreshing state... [id=operations-engineering-join-github:DEV_ECR_REGION]
module.ministryofjustice.module.moj-terraform-aws-sso.data.github_actions_public_key.default: Read complete after 6s [id=3380204578043523366]
module.ministryofjustice.module.operations-engineering-join-github.github_actions_variable.default["DEV_ECR_REPOSITORY"]: Refreshing state... [id=operations-engineering-join-github:DEV_ECR_REPOSITORY]
module.ministryofjustice.module.operations-engineering-join-github.github_actions_variable.default["DEV_ECR_REGISTRY"]: Refreshing state... [id=operations-engineering-join-github:DEV_ECR_REGISTRY]
module.ministryofjustice.module.operations-engineering-join-github.github_actions_variable.default["PROD_ECR_REPOSITORY"]: Refreshing state... [id=operations-engineering-join-github:PROD_ECR_REPOSITORY]
module.ministryofjustice.module.operations-engineering-find-a-github-repository-owner.data.github_actions_public_key.default: Read complete after 7s [id=3380204578043523366]
module.ministryofjustice.module.operations-engineering-join-github.github_actions_variable.default["PROD_ECR_REGION"]: Refreshing state... [id=operations-engineering-join-github:PROD_ECR_REGION]
module.ministryofjustice.module.operations-engineering-cloud-platform-namespace.data.github_actions_public_key.default: Read complete after 6s [id=3380204578043523366]
module.ministryofjustice.module.operations-engineering-join-github.github_branch_protection.default: Refreshing state... [id=BPR_kwDOKeC4ns4CwPGB]
module.ministryofjustice.module.operations-engineering-join-github.data.github_actions_public_key.default: Reading...
module.ministryofjustice.module.operations-engineering-support-metadata.data.github_actions_public_key.default: Read complete after 6s [id=3380204578043523366]
module.ministryofjustice.module.operations-engineering-unit-test-generator-poc.github_branch_protection.default: Refreshing state... [id=BPR_kwDOMj97Js4DLjTW]
module.ministryofjustice.module.operations-engineering-unit-test-generator-poc.data.github_actions_public_key.default: Reading...
module.ministryofjustice.module.test_tamf_repo_2.github_branch_protection.default: Refreshing state... [id=BPR_kwDOLRPf1s4Cyrgn]
module.ministryofjustice.module.test_tamf_repo_2.data.github_actions_public_key.default: Reading...
module.ministryofjustice.module.operations-engineering-reports.github_branch_protection.default: Refreshing state... [id=BPR_kwDOEpRCis4CwPF-]
module.ministryofjustice.module.operations-engineering-reports.data.github_actions_public_key.default: Reading...
module.ministryofjustice.module.operations-engineering-reports.github_actions_variable.default["DEVELOPMENT_ECR_REPOSITORY"]: Refreshing state... [id=operations-engineering-reports:DEVELOPMENT_ECR_REPOSITORY]
module.ministryofjustice.module.operations-engineering-reports.github_actions_variable.default["PRODUCTION_ECR_REPOSITORY"]: Refreshing state... [id=operations-engineering-reports:PRODUCTION_ECR_REPOSITORY]
module.ministryofjustice.module.operations-engineering-reports.github_actions_variable.default["PRODUCTION_ECR_REGION"]: Refreshing state... [id=operations-engineering-reports:PRODUCTION_ECR_REGION]
module.ministryofjustice.module.operations-engineering-join-github.data.github_actions_public_key.default: Read complete after 4s [id=3380204578043523366]
module.ministryofjustice.module.operations-engineering-reports.github_actions_variable.default["DEVELOPMENT_ECR_REGION"]: Refreshing state... [id=operations-engineering-reports:DEVELOPMENT_ECR_REGION]
module.ministryofjustice.module.operations-engineering-reports.github_actions_variable.default["ECR_REGISTRY"]: Refreshing state... [id=operations-engineering-reports:ECR_REGISTRY]
module.ministryofjustice.module.operations-engineering-unit-test-generator-poc.data.github_actions_public_key.default: Read complete after 5s [id=3380204578043523366]
module.ministryofjustice.module.operations-engineering-flask-template.github_branch_protection.default: Refreshing state... [id=BPR_kwDOMwBtfM4DPKBJ]
module.ministryofjustice.module.operations-engineering-flask-template.data.github_actions_public_key.default: Reading...
module.ministryofjustice.module.test_tamf_repo_2.data.github_actions_public_key.default: Read complete after 4s [id=3380204578043523366]
module.ministryofjustice.module.template-repository.data.github_actions_public_key.default: Reading...
module.ministryofjustice.module.template-repository.github_branch_protection.default: Refreshing state... [id=BPR_kwDODYkhA84CwPiC]
module.ministryofjustice.module.operations-engineering-reports.data.github_actions_public_key.default: Read complete after 5s [id=3380204578043523366]
module.ministryofjustice.module.github-collaborators.data.github_actions_public_key.default: Reading...
module.ministryofjustice.module.github-collaborators.github_branch_protection.default: Refreshing state... [id=BPR_kwDOEoQScc4CwGtd]
module.ministryofjustice.module.operations-engineering-kpi-dashboard.github_branch_protection.default: Refreshing state... [id=BPR_kwDOL1tpxs4DIuFD]
module.ministryofjustice.module.operations-engineering-kpi-dashboard.data.github_actions_public_key.default: Reading...
module.ministryofjustice.module.terraform-github-repository.github_branch_protection.default: Refreshing state... [id=BPR_kwDOLELUgs4CwzoY]
module.ministryofjustice.module.terraform-github-repository.data.github_actions_public_key.default: Reading...
module.ministryofjustice.data.aws_secretsmanager_secret_version.example_secret_version: Reading...
module.ministryofjustice.data.aws_secretsmanager_secret_version.example_secret_version: Read complete after 0s [id=arn:aws:secretsmanager:eu-west-2:880656497252:secret:EXAMPLE_SECRET-8FFCA9|AWSCURRENT]
module.ministryofjustice.module.github-actions.github_branch_protection.default: Refreshing state... [id=BPR_kwDODNFKOs4CwGtk]
module.ministryofjustice.module.operations-engineering-flask-template.data.github_actions_public_key.default: Read complete after 4s [id=3380204578043523366]
module.ministryofjustice.module.github-actions.data.github_actions_public_key.default: Reading...
module.ministryofjustice.module.template-repository.data.github_actions_public_key.default: Read complete after 3s [id=3380204578043523366]
module.ministryofjustice.module.operations-engineering.github_branch_protection.default: Refreshing state... [id=BPR_kwDODVCV0c4CwPYY]
module.ministryofjustice.module.operations-engineering.data.github_actions_public_key.default: Reading...
module.ministryofjustice.module.github-collaborators.data.github_actions_public_key.default: Read complete after 3s [id=3380204578043523366]
module.ministryofjustice.module.operations-engineering-documentation-browser-extension.data.github_actions_public_key.default: Reading...
module.ministryofjustice.module.operations-engineering-documentation-browser-extension.github_branch_protection.default: Refreshing state... [id=BPR_kwDOK636CM4CwPF8]
module.ministryofjustice.module.operations-engineering-metadata-poc.data.github_actions_public_key.default: Reading...
module.ministryofjustice.module.operations-engineering-kpi-dashboard.data.github_actions_public_key.default: Read complete after 5s [id=3380204578043523366]
module.ministryofjustice.module.operations-engineering-metadata-poc.github_actions_variable.default["DEVELOPMENT_ECR_REGION"]: Refreshing state... [id=operations-engineering-metadata-poc:DEVELOPMENT_ECR_REGION]
module.ministryofjustice.module.operations-engineering-metadata-poc.github_actions_variable.default["ECR_REGISTRY"]: Refreshing state... [id=operations-engineering-metadata-poc:ECR_REGISTRY]
module.ministryofjustice.module.terraform-github-repository.data.github_actions_public_key.default: Read complete after 6s [id=3380204578043523366]
module.ministryofjustice.module.operations-engineering-metadata-poc.github_actions_variable.default["DEVELOPMENT_ECR_REPOSITORY"]: Refreshing state... [id=operations-engineering-metadata-poc:DEVELOPMENT_ECR_REPOSITORY]
module.ministryofjustice.module.operations-engineering-metadata-poc.github_branch_protection.default: Refreshing state... [id=BPR_kwDOKeC3Jc4CwPGL]
module.ministryofjustice.module.github-actions.data.github_actions_public_key.default: Read complete after 6s [id=3380204578043523366]
module.ministryofjustice.module.operations-engineering-user-guide.data.github_actions_public_key.default: Reading...
module.ministryofjustice.module.operations-engineering-user-guide.github_branch_protection.default: Refreshing state... [id=BPR_kwDOKCGhm84CwPGO]
module.ministryofjustice.module.operations-engineering.data.github_actions_public_key.default: Read complete after 8s [id=3380204578043523366]
module.ministryofjustice.module.operations-engineering-certificate-form.github_branch_protection.default: Refreshing state... [id=BPR_kwDOM5POVs4DRomf]
module.ministryofjustice.module.operations-engineering-documentation-browser-extension.data.github_actions_public_key.default: Read complete after 7s [id=3380204578043523366]
module.ministryofjustice.module.operations-engineering-certificate-form.data.github_actions_public_key.default: Reading...
module.ministryofjustice-test.module.test_tamf_repo_test_org.github_team_repository.maintain["9456244"]: Refreshing state... [id=9456244:test-tamf-repo-test-org]
module.ministryofjustice-test.module.test_tamf_repo_test_org.github_team_repository.push["9472191"]: Refreshing state... [id=9472191:test-tamf-repo-test-org]
module.ministryofjustice.module.test_tamf_repo_2.github_actions_secret.default["EXAMPLE_SECRET"]: Refreshing state... [id=test-tamf-repo-2:EXAMPLE_SECRET]
module.ministryofjustice.module.operations-engineering-metadata-poc.data.github_actions_public_key.default: Read complete after 6s [id=3380204578043523366]
module.ministryofjustice.module.tech-docs-monitor.github_team_repository.admin["4192115"]: Refreshing state... [id=4192115:tech-docs-monitor]
module.ministryofjustice.module.acronyms.github_team_repository.admin["4192115"]: Refreshing state... [id=4192115:acronyms]
module.ministryofjustice.module.operations-engineering-join-github.github_team_repository.admin["4192115"]: Refreshing state... [id=4192115:operations-engineering-join-github]
module.ministryofjustice.module.test_tamf_repo_2.github_team_repository.maintain["4192115"]: Refreshing state... [id=4192115:test-tamf-repo-2]
module.ministryofjustice.module.template-documentation-site.github_team_repository.admin["4192115"]: Refreshing state... [id=4192115:template-documentation-site]
module.ministryofjustice.module.operations-engineering-user-guide.data.github_actions_public_key.default: Read complete after 5s [id=3380204578043523366]
module.ministryofjustice.module.operations-engineering-devcontainer.github_team_repository.admin["4192115"]: Refreshing state... [id=4192115:operations-engineering-devcontainer]
module.ministryofjustice.module.operations-engineering-flask-template.github_team_repository.admin["4192115"]: Refreshing state... [id=4192115:operations-engineering-flask-template]
module.ministryofjustice.module.operations-engineering-dns-form.github_team_repository.admin["4192115"]: Refreshing state... [id=4192115:operations-engineering-dns-form]
module.ministryofjustice.module.operations-engineering-certificate-form.data.github_actions_public_key.default: Read complete after 5s [id=3380204578043523366]
module.ministryofjustice.module.operations-engineering-certificate-form.github_team_repository.admin["4192115"]: Refreshing state... [id=4192115:operations-engineering-certificate-form]
module.ministryofjustice.module.github-collaborators.github_team_repository.admin["4192115"]: Refreshing state... [id=4192115:github-collaborators]
module.ministryofjustice.module.operations-engineering-metadata-poc.github_team_repository.admin["4192115"]: Refreshing state... [id=4192115:operations-engineering-metadata-poc]
module.ministryofjustice.module.operations-engineering-cloud-platform-namespace.github_team_repository.admin["4192115"]: Refreshing state... [id=4192115:operations-engineering-cloud-platform-namespace]
module.ministryofjustice.module.operations-engineering-example.github_team_repository.admin["4192115"]: Refreshing state... [id=4192115:operations-engineering-example]
module.ministryofjustice.module.cloud-platform-maintenance-pages.github_team_repository.admin["4192115"]: Refreshing state... [id=4192115:cloud-platform-maintenance-pages]
module.ministryofjustice.module.moj-terraform-aws-sso.github_team_repository.admin["4192115"]: Refreshing state... [id=4192115:moj-terraform-aws-sso]
module.ministryofjustice.module.operations-engineering-certificate-renewal.github_team_repository.admin["4192115"]: Refreshing state... [id=4192115:operations-engineering-certificate-renewal]
module.ministryofjustice.module.tech-docs-github-pages-publisher.github_team_repository.admin["4192115"]: Refreshing state... [id=4192115:tech-docs-github-pages-publisher]
module.ministryofjustice.module.operations-engineering-dns-issues.github_team_repository.admin["4192115"]: Refreshing state... [id=4192115:operations-engineering-dns-issues]
module.ministryofjustice.module.operations-engineering.github_team_repository.admin["4192115"]: Refreshing state... [id=4192115:operations-engineering]
module.ministryofjustice.module.terraform-github-repository.github_team_repository.admin["4192115"]: Refreshing state... [id=4192115:terraform-github-repository]
module.ministryofjustice.module.template-repository.github_team_repository.admin["4192115"]: Refreshing state... [id=4192115:template-repository]
module.ministryofjustice.module.operations-engineering-reports.github_team_repository.admin["4192115"]: Refreshing state... [id=4192115:operations-engineering-reports]
module.ministryofjustice.module.operations-engineering-octodns-poc.github_team_repository.admin["4192115"]: Refreshing state... [id=4192115:operations-engineering-octodns-poc]
module.ministryofjustice.module.operations-engineering-dns-spike.github_team_repository.admin["4192115"]: Refreshing state... [id=4192115:operations-engineering-dns-spike]
module.ministryofjustice.module.operations-engineering-user-guide.github_team_repository.admin["4192115"]: Refreshing state... [id=4192115:operations-engineering-user-guide]
module.ministryofjustice.module.terraform-aws-mtasts.github_team_repository.admin["4192115"]: Refreshing state... [id=4192115:terraform-aws-mtasts]
module.ministryofjustice.module.operations-engineering-support-metadata.github_team_repository.admin["4192115"]: Refreshing state... [id=4192115:operations-engineering-support-metadata]
module.ministryofjustice.module.operations-engineering-kpi-dashboard.github_team_repository.admin["4192115"]: Refreshing state... [id=4192115:operations-engineering-kpi-dashboard]
module.ministryofjustice.module.technical-guidance.github_team_repository.admin["4192115"]: Refreshing state... [id=4192115:technical-guidance]
module.ministryofjustice.module.github-actions.github_team_repository.admin["4192115"]: Refreshing state... [id=4192115:github-actions]
module.ministryofjustice.module.operations-engineering-documentation-browser-extension.github_team_repository.admin["4192115"]: Refreshing state... [id=4192115:operations-engineering-documentation-browser-extension]
module.ministryofjustice.module.operations-engineering-unit-test-generator-poc.github_team_repository.admin["4192115"]: Refreshing state... [id=4192115:operations-engineering-unit-test-generator-poc]
module.ministryofjustice.module.operations-engineering-github-actions-dashboard.github_team_repository.admin["4192115"]: Refreshing state... [id=4192115:operations-engineering-github-actions-dashboard]
module.ministryofjustice.module.operations-engineering-find-a-github-repository-owner.github_team_repository.admin["4192115"]: Refreshing state... [id=4192115:operations-engineering-find-a-github-repository-owner]
module.ministryofjustice.module.operations-engineering-runbooks.github_team_repository.admin["4192115"]: Refreshing state... [id=4192115:operations-engineering-runbooks]
module.ministryofjustice.module.moj-terraform-scim-github.github_team_repository.admin["4192115"]: Refreshing state... [id=4192115:moj-terraform-scim-github]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.ministryofjustice.module.github-collaborators.github_repository.default has changed
  ~ resource "github_repository" "default" {
      ~ etag                        = "W/\"5df45f7fc132c0cb82543e2991dd88f8541232c643cad6e1ecb2a8784678963f\"" -> "W/\"ac49d03dd000f691505ebfb6441e1be064b81648a581b2d5cbde6df9376ad917\""
        id                          = "github-collaborators"
        name                        = "github-collaborators"
        # (35 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.ministryofjustice.module.operations-engineering.github_repository.default has changed
  ~ resource "github_repository" "default" {
      ~ etag                        = "W/\"97831c90d27d69e6769b77805d822217a4bd77b52d4061713b6f24bdb08f476c\"" -> "W/\"2d61a4ec09227ac4455fb9487e874acb4fadf55a64b881eadac7d927a7144d42\""
        id                          = "operations-engineering"
        name                        = "operations-engineering"
        # (36 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.ministryofjustice.module.operations-engineering-certificate-form.github_branch_protection.default has changed
  ~ resource "github_branch_protection" "default" {
      + force_push_bypassers            = []
        id                              = "BPR_kwDOM5POVs4DRomf"
      + push_restrictions               = []
        # (10 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          + dismissal_restrictions          = []
          + pull_request_bypassers          = []
            # (5 unchanged attributes hidden)
        }

      ~ required_status_checks {
          + contexts = []
            # (1 unchanged attribute hidden)
        }
    }

  # module.ministryofjustice.module.operations-engineering-certificate-form.github_repository.default has changed
  ~ resource "github_repository" "default" {
      ~ etag                        = "W/\"48fb2d3d187e829552ddc00a18884488f0bebbd413e3dae7acf323d703afc45d\"" -> "W/\"913b394a18f52fbf4b97d952a374b6d63e658fb3b9e1bc9d176f59d8c5afb857\""
        id                          = "operations-engineering-certificate-form"
        name                        = "operations-engineering-certificate-form"
        # (35 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.ministryofjustice.module.operations-engineering-dns-form.github_repository.default has changed
  ~ resource "github_repository" "default" {
      ~ etag                        = "W/\"641eeccb2b92f0be4359499dbd719abe75b2931a85b665475e69f6c83fa38f22\"" -> "W/\"ccc42d4615bbe8ce69837b9406d21f86275a984912b3c454abeedd16e853e02b\""
        id                          = "operations-engineering-dns-form"
        name                        = "operations-engineering-dns-form"
        # (36 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.ministryofjustice.module.operations-engineering-dns-issues.github_repository.default has changed
  ~ resource "github_repository" "default" {
      ~ etag                        = "W/\"96997aaeb5849c6d4e8dfeb2c624f670bd8a584c150fd4dfa4e58e26bd059d6b\"" -> "W/\"e62937b5c4817273f666e81b837740cfc80818c6fc22ad8182fe16ae3f50d402\""
        id                          = "operations-engineering-dns-issues"
        name                        = "operations-engineering-dns-issues"
        # (34 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.ministryofjustice.module.operations-engineering-find-a-github-repository-owner.github_repository.default has changed
  ~ resource "github_repository" "default" {
      ~ etag                        = "W/\"89b1da4d3690a7849901a4add641b2f6c77f6f4aeb78041b3dadf5784f6a62d8\"" -> "W/\"8ce2f7405d929b12daa0d1b277a68896c3484ac577117fc18f21d6eb0ab9bf18\""
        id                          = "operations-engineering-find-a-github-repository-owner"
        name                        = "operations-engineering-find-a-github-repository-owner"
        # (35 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.ministryofjustice.module.operations-engineering-flask-template.github_repository.default has changed
  ~ resource "github_repository" "default" {
      ~ etag                        = "W/\"b1ff59106d8c87bdeb1494e16c6497cf6133a7a1bcd55e84b860752e40fa3892\"" -> "W/\"21f2eb461a8bed90ecff36ee1b86ebfd4f4265d07d8d2239618f5e416392fa49\""
        id                          = "operations-engineering-flask-template"
        name                        = "operations-engineering-flask-template"
        # (35 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.ministryofjustice.module.operations-engineering-octodns-poc.github_repository.default has changed
  ~ resource "github_repository" "default" {
      ~ etag                        = "W/\"90f5cf192126532aecaaec5fa11b35bc4cb54bd2e1bf03be746f3bd9d64c1cf9\"" -> "W/\"5bf69c086c4efce19c6099887eb757373cbb24ccb7d8f2113da5c3dd654468a2\""
        id                          = "operations-engineering-octodns-poc"
        name                        = "operations-engineering-octodns-poc"
        # (34 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.ministryofjustice.module.operations-engineering-user-guide.github_repository.default has changed
  ~ resource "github_repository" "default" {
      ~ etag                        = "W/\"6bd1563f26698c4b57457d7c6f1bab4eba5869bef075615b27fdff8c8aafd716\"" -> "W/\"0568ded8dba844a6a67604ea971877f544a96a43ff73a797649d2d1a24dbbd97\""
        id                          = "operations-engineering-user-guide"
        name                        = "operations-engineering-user-guide"
        # (36 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.ministryofjustice.module.tech-docs-monitor.github_repository.default has changed
  ~ resource "github_repository" "default" {
      ~ etag                        = "W/\"9c147ec910194d2eed12630f5694d3338e84d8599575b38061f2591a771de162\"" -> "W/\"6f846395782ce445dd2f7c6d7b15a999e0f30d57bfdf61cd7e8375fec3344be1\""
        id                          = "tech-docs-monitor"
        name                        = "tech-docs-monitor"
        # (35 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.ministryofjustice.module.terraform-github-repository.github_repository.default has changed
  ~ resource "github_repository" "default" {
      ~ etag                        = "W/\"715ea6cd5ada7671505bf73ef01672694b7726d76dcbe30144bcbc9e515f38be\"" -> "W/\"3da0a05d3cfc5f5d0e8d743fb59ee5590ce32b8fa09a50ae2c323c44e8f188d3\""
        id                          = "terraform-github-repository"
        name                        = "terraform-github-repository"
        # (35 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # module.ministryofjustice.module.operations-engineering-acronyms-app-poc.data.github_actions_public_key.default will be read during apply
  # (config refers to values not yet known)
 <= data "github_actions_public_key" "default" {
      + id         = (known after apply)
      + key        = (known after apply)
      + key_id     = (known after apply)
      + repository = (known after apply)
    }

  # module.ministryofjustice.module.operations-engineering-acronyms-app-poc.github_branch_protection.default will be created
  + resource "github_branch_protection" "default" {
      + allows_deletions                = false
      + allows_force_pushes             = false
      + blocks_creations                = false
      + enforce_admins                  = true
      + id                              = (known after apply)
      + lock_branch                     = false
      + pattern                         = "main"
      + repository_id                   = (known after apply)
      + require_conversation_resolution = false
      + require_signed_commits          = false
      + required_linear_history         = false

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = true
          + require_code_owner_reviews      = true
          + require_last_push_approval      = false
          + required_approving_review_count = 1
        }

      + required_status_checks {
          + strict = false
        }
    }

  # module.ministryofjustice.module.operations-engineering-acronyms-app-poc.github_repository.default will be created
  + resource "github_repository" "default" {
      + allow_auto_merge            = false
      + allow_merge_commit          = true
      + allow_rebase_merge          = true
      + allow_squash_merge          = true
      + archive_on_destroy          = true
      + archived                    = false
      + auto_init                   = false
      + default_branch              = (known after apply)
      + delete_branch_on_merge      = true
      + description                 = "A web app for viewing and adding acronyms, featuring sentiment analysis validation. • This repository is defined and managed in Terraform"
      + etag                        = (known after apply)
      + full_name                   = (known after apply)
      + git_clone_url               = (known after apply)
      + has_discussions             = false
      + has_downloads               = true
      + has_issues                  = true
      + has_projects                = true
      + has_wiki                    = true
      + html_url                    = (known after apply)
      + http_clone_url              = (known after apply)
      + id                          = (known after apply)
      + is_template                 = false
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
      + name                        = "operations-engineering-acronyms-app-poc"
      + node_id                     = (known after apply)
      + primary_language            = (known after apply)
      + private                     = (known after apply)
      + repo_id                     = (known after apply)
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
      + ssh_clone_url               = (known after apply)
      + svn_url                     = (known after apply)
      + topics                      = [
          + "operations-engineering",
          + "poc",
        ]
      + visibility                  = "public"
      + vulnerability_alerts        = true
      + web_commit_signoff_required = false

      + security_and_analysis {
          + secret_scanning {
              + status = "enabled"
            }
          + secret_scanning_push_protection {
              + status = "enabled"
            }
        }

      + template {
          + include_all_branches = false
          + owner                = "ministryofjustice"
          + repository           = "operations-engineering-flask-template"
        }
    }

  # module.ministryofjustice.module.operations-engineering-acronyms-app-poc.github_team_repository.admin["4192115"] will be created
  + resource "github_team_repository" "admin" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "admin"
      + repository = "operations-engineering-acronyms-app-poc"
      + team_id    = "4192115"
    }

Plan: 3 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```